vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32FG23_DFP.pdsc
        <!-- *************************  Device 'EFR32FG23A020F512GM48'  ***************************** -->
        <device Dname="EFR32FG23A020F512GM48">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23A020F512GM48"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23A020F512GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32FG23A021">
        <book         name="Documents/efr32fg23-datasheet.pdf"      title="EFR32FG23A021 Data Sheet"/>
        <book         name="Documents/efr32fg23-errata.pdf"         title="EFR32FG23A021 Errata"/>
        <!-- *************************  Device 'EFR32FG23A021F512GM40'  ***************************** -->
        <device Dname="EFR32FG23A021F512GM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23A021F512GM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23A021F512GM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32FG23B010">
        <book         name="Documents/efr32fg23-datasheet.pdf"      title="EFR32FG23B010 Data Sheet"/>
        <book         name="Documents/efr32fg23-errata.pdf"         title="EFR32FG23B010 Errata"/>
        <!-- *************************  Device 'EFR32FG23B010F128GM40'  ***************************** -->
        <device Dname="EFR32FG23B010F128GM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B010F128GM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B010F128GM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32FG23B010F512GM48'  ***************************** -->
        <device Dname="EFR32FG23B010F512GM48">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B010F512GM48"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B010F512GM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32FG23B010F512IM40'  ***************************** -->
        <device Dname="EFR32FG23B010F512IM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B010F512IM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B010F512IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32FG23B010F512IM48'  ***************************** -->
        <device Dname="EFR32FG23B010F512IM48">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B010F512IM48"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B010F512IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32FG23B020">
        <book         name="Documents/efr32fg23-datasheet.pdf"      title="EFR32FG23B020 Data Sheet"/>
        <book         name="Documents/efr32fg23-errata.pdf"         title="EFR32FG23B020 Errata"/>
        <!-- *************************  Device 'EFR32FG23B020F128GM40'  ***************************** -->
        <device Dname="EFR32FG23B020F128GM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B020F128GM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B020F128GM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32FG23B020F512IM40'  ***************************** -->
        <device Dname="EFR32FG23B020F512IM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B020F512IM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B020F512IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32FG23B020F512IM48'  ***************************** -->
        <device Dname="EFR32FG23B020F512IM48">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B020F512IM48"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B020F512IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32FG23B021">
        <book         name="Documents/efr32fg23-datasheet.pdf"      title="EFR32FG23B021 Data Sheet"/>
        <book         name="Documents/efr32fg23-errata.pdf"         title="EFR32FG23B021 Errata"/>
        <!-- *************************  Device 'EFR32FG23B021F512IM40'  ***************************** -->
        <device Dname="EFR32FG23B021F512IM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B021F512IM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B021F512IM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

        <!-- *************************  Device 'EFR32FG23B021F512IM48'  ***************************** -->
        <device Dname="EFR32FG23B021F512IM48">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23B021F512IM48"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23B021F512IM48.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

