vvpai9/Keil/Keil_v5/ARM/Pack/.Web/SiliconLabs.GeckoPlatform_EFR32FG23_DFP.pdsc
      <subFamily DsubFamily="EFR32FG23L010">
        <book         name="Documents/efr32fg23-datasheet.pdf"      title="EFR32FG23L010 Data Sheet"/>
        <book         name="Documents/efr32fg23-errata.pdf"         title="EFR32FG23L010 Errata"/>
        <!-- *************************  Device 'EFR32FG23L010F128GM40'  ***************************** -->
        <device Dname="EFR32FG23L010F128GM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23L010F128GM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23L010F128GM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

      <subFamily DsubFamily="EFR32FG23L020">
        <book         name="Documents/efr32fg23-datasheet.pdf"      title="EFR32FG23L020 Data Sheet"/>
        <book         name="Documents/efr32fg23-errata.pdf"         title="EFR32FG23L020 Errata"/>
        <!-- *************************  Device 'EFR32FG23L020F128GM40'  ***************************** -->
        <device Dname="EFR32FG23L020F128GM40">
          <compile header="Device/SiliconLabs/EFR32FG23/Include/em_device.h"  define="EFR32FG23L020F128GM40"/>
          <debug      svd="SVD/EFR32FG23/EFR32FG23L020F128GM40.svd"/>
          <memory     id="IROM1"                start="0x00000000"  size="0x00000000"  startup="1"   default="1"/>
          <memory     id="IRAM1"                start="0x00000000"  size="0x00000000"  init   ="0"   default="1"/>
          <algorithm  name="Flash/GECKOS2C3.FLM"  start="0x00000000"  size="0x00000000"  RAMstart="0x20000000" RAMsize="0x8000" default="1" style="Keil"/>
          <algorithm  name="Flash/FlashGECKOS2C3.flash"  start="0x00000000"  size="0x00000000"  default="0"  style="IAR"/>
        </device>

      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="Compiler IAR">
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFR32FG23">
      <description>Silicon Labs EFR32FG23 device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFR32FG23*"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="2025.6.2" condition="EFR32FG23">
      <description>System Startup for Silicon Labs EFR32FG23 device series</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/SiliconLabs/EFR32FG23/Include/"/>
        <file category="header"  name="Device/SiliconLabs/EFR32FG23/Include/em_device.h"/>
        <!-- system file -->
        <file category="source"  name="Device/SiliconLabs/EFR32FG23/Source/system_efr32fg23.c" attr="config" version="2025.6.2"/>
      </files>
    </component>
  </components>
</package>
